InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетВыпускаПродукцииПоДаннымПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиТоваровВРознице</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОсновнойСчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВыпускПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОказаниеУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДиректКостинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокСписанияРасходовНаСебестоимостьУслуг</Name>
					<Comment>Планируется к удалению</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияРасходовНаСебестоимостьУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРассчитыватьСебестоимостьПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСебестоимостиПроизводства</Name>
					<Comment>Планируется к удалению</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСебестоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРассчитыватьСебестоимостьУслугСобственнымПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСпособУчетаВыпускаГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаСтоимостиВыпуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоСтатьямЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРезервыПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантБухгалтерскойОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддержкаПБУ18</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьПлановуюСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаОтложенногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаОтложенногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРасходыОбслуживающихПроизводствВключатьВПрочиеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияАвансовВыданных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОтраженияАвансовВыданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмыПериодаАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиСущественностиВнеоборотныхАктивов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиСущественностиВнеоборотныхАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределятьЕдиныйНалоговыйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьАктивыОбязательстваПоСрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Госпошлина_ГосрегистрацияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ВредныеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_Шахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ВнутригородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МежселеннаяТерритория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_СельскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмуществоЕСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_РегиональныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_ФедеральныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС_ВвозимыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеНалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ВнутригородскойРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС_НСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_МинимальныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалоговыйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОПС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОМС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОСС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТуристическийНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗаполнениеБухгалтерскойОтчетностиПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ БУХГАЛТЕРСКОЙ ОТЧЕТНОСТИ.
// Модуль содержит переопределяемые процедуры и функции.
// Предназначен для заполнения регламентированного отчета
// "Бухгалтерская отчетность организаций" и финансовой отчетности в банки.
////////////////////////////////////////////////////////////////////////////////

//@skip-check module-empty-method

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеБухгалтерскойОтчетностиПравила

// Процедуры этого раздела позволяют подключить алгоритмы заполнения бухгалтерской отчетности.
// Подробнее см. описание и одноименные методы в модуле ЗаполнениеБухгалтерскойОтчетностиПравила

// См. ЗаполнениеБухгалтерскойОтчетностиПравила.ЗаполнитьНастройкиПоУмолчанию
// 
// Параметры:
//  ВыполненоПереопределение - Булево - возвращаемый параметр, следует установить Истина, если модифицированы какие-либо значения других параметров
//  Процессор - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ЗаполнитьНастройкиПоУмолчанию
//
Процедура ЗаполнитьНастройкиПоУмолчанию(ВыполненоПереопределение, Процессор) Экспорт
	
	
	
КонецПроцедуры

// См. ЗаполнениеБухгалтерскойОтчетностиПравила.ПолучитьДанныеУчета
// 
// Параметры:
//  ВыполненоПереопределение - Булево - возвращаемый параметр, следует установить Истина, если модифицированы какие-либо значения других параметров
//  Процессор - см. ПолучитьДанныеУчета
Процедура ПолучитьДанныеУчета(ВыполненоПереопределение, Процессор) Экспорт
	
	
	
КонецПроцедуры

// См. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьПорядокЗаполненияПоказателя
// 
// Параметры:
//  ВыполненоПереопределение - Булево - возвращаемый параметр, следует установить Истина, если модифицированы какие-либо значения других параметров
//  Описание - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьПорядокЗаполненияПоказателя
//  Показатель - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьПорядокЗаполненияПоказателя
//  ЭтоОсновнойПоказатель - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьПорядокЗаполненияПоказателя
//  Процессор - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьПорядокЗаполненияПоказателя
Процедура ОписатьПорядокЗаполненияПоказателя(ВыполненоПереопределение, Описание, Показатель, ЭтоОсновнойПоказатель, Процессор) Экспорт
	
	
	
КонецПроцедуры

// См. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
// 
// Параметры:
//  ВыполненоПереопределение - Булево - возвращаемый параметр, следует установить Истина, если модифицированы какие-либо значения других параметров
//  ЗаписьРасчет - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
//  СоставШагаРасчета - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
//  КешПредставлений - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
//  ОписаниеПорядкаЗаполненияПоказателя - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
//  Процессор - см. ЗаполнениеБухгалтерскойОтчетностиПравила.ОписатьЗаполняемоеЗначение
Процедура ОписатьЗаполняемоеЗначение(ВыполненоПереопределение, ЗаписьРасчет, СоставШагаРасчета, КешПредставлений, ОписаниеПорядкаЗаполненияПоказателя, Процессор) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеБухгалтерскойОтчетностиПоказатели

// Возвращает признак учета расходов по элементам затрат организацией в течении указанного периода.
//
// Параметры:
//   НачалоПериодаОтчета - Дата - дата начала периода, за который проводится проверка вида учета расходов;
//   КонецПериодаОтчета - Дата - дата конца периода, за который проводится проверка вида учета расходов;
//   Организация - СправочникСсылка.Организации - организация, для которой нужно получить признак.
//
// Возвращаемое значение:
//   Булево - Истина, если в течении проверяемого периода организация вела учет расходов
//     по элементам затрат.
//
// Пример реализации:
//   Возврат ЭлементыЗатратНастройкаПараметровУчета.РасходыУчитываютсяПоЭлементамЗатрат(
//     НачалоПериодаОтчета, КонецПериодаОтчета, Организация);
//
Функция РасходыУчитываютсяПоЭлементамЗатрат(НачалоПериодаОтчета, КонецПериодаОтчета, Организация) Экспорт
	
	Возврат ЭлементыЗатратНастройкаПараметровУчета.РасходыУчитываютсяПоЭлементамЗатрат(
		НачалоПериодаОтчета, КонецПериодаОтчета, Организация);
	
КонецФункции

// Заполняет описание структуры отчета о целевом использовании полученных средств - состав ее граф и строк
//
// Параметры:
//  Строки		 - Строка - возвращаемый параметр - перечень четырехзначных номеров строк отчета, разделенных запятыми
//  Упрощенная	 - Булево - Истина для упрощенной отчетности (содержащей сокращенный перечень строк)
//
Процедура ЗаполнитьОписаниеСтрокОЦИС(Строки, Упрощенная) Экспорт
	
КонецПроцедуры

// Предоставляет данные для заполнения отчета об использовании целевых поступивших средств.
// Данные собираются по одной организации, без учета входящих в нее филиалов.
//
// Параметры:
//  ПоказателиОтчета - Соответствие из Число - возвращаемый параметр, значения для заполнения строк отчета.
//                     Ключ элемента (тип Строка) содержит четырехсимвольный код строки;
//                     Значение элемента (тип Число) содержит значение показателя.
//  РасшифровкаОтчета - ТаблицаЗначений - см. ЗаполнениеРасшифровкаРегламентированнойОтчетности.НовыйРасшифровка
//                      В таблице в поле ИмяПоказателя указывается четырехсимвольный код строки;
//                      не заполняется поле ИмяРаздела, определяемое кодом строки отчета.
//  НачалоПериода - Дата - начало периода отчета (без времени)
//  КонецПериода  - Дата - конец периода отчета (без времени)
//  Организация   - СправочникСсылка.Организации - организация, по которой собираются данные
//  Упрощенная    - Булево - Истина для упрощенной отчетности (с меньшей детализацией)
//
Процедура ПолучитьДанныеЗаполненияОЦИС(ПоказателиОтчета, РасшифровкаОтчета, НачалоПериода, КонецПериода, Организация, Упрощенная) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеБухгалтерскойОтчетностиПояснения

// Проверяет, должны для организации в отчетном периоде применяться правила учета обесценения в соответствии с ФСБУ 5
// или в соответствии с предыдущим стандартом.
//
// Параметры:
//  Применяется  - Булево - возвращаемый параметр; Истина, если действует ФСБУ 5, Ложь - если ПБУ 5
//  Организация  - СправочникСсылка.Организации
//  Период       - Дата - любая дата из отчетного периода
//
Процедура ПроверитьПрименяетсяОбесценениеФСБУ5(Применяется, Организация, Период) Экспорт
	
	ПервоеПрименение = РегистрыСведений.УчетнаяПолитика.ГодПервогоПримененияФСБУ5(Организация);
	
	Если ПервоеПрименение = Неопределено Или Период > ПервоеПрименение Тогда
		Применяется = Истина;
	Иначе
		// Возможно, речь идет о первом периоде после создания организации
		ОписаниеПериода  = БухгалтерскийУчет.БлижайшийОтчетныйПериод(Период, Организация);
		Применяется      = (ОписаниеПериода.Период >= ПервоеПрименение);
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает сумму выбытия обесценения запасов алгоритмом, специфичным для конкретного прикладного решения.
//
// Параметры:
//  Выбытие       - Число - возвращаемый параметр, сумма выбытия обесценения
//                - Неопределено - в прикладном решении алгоритм расчета не определен
//  Организация   - СправочникСсылка.Организации - организация, по которой заполняется отчетность
//  НачалоПериода - Дата - начало периода отчета (без времени)
//  КонецПериода  - Дата - конец периода отчета (без времени)
//  Счет          - ПланСчетовСсылка.Хозрасчетный - счет резерва (субсчет счета 14 или счет 14 в целом)
//
Процедура РассчитатьВыбытиеОбесцененияЗапасов(Выбытие, Организация, НачалоПериода, КонецПериода, Счет) Экспорт
	
	УчетОбесцененияАктивов.РассчитатьВыбытиеОбесцененияЗапасов(Выбытие, Организация, НачалоПериода, КонецПериода, Счет);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет переменную ссылкой на предопределенный счет по его условному коду.
//
// Параметры:
//   УсловныйКодСчета - Строка - условный код счета, используемый в алгоритмах заполнения;
//   Результат - Произвольный - переменная, в которую помещается ссылка на найденный счет плана счетов.
//
// Пример:
//   Если УсловныйКодСчета = "76.51" Тогда
//       Результат = ПланыСчетов.Хозрасчетный.РасчетыПоЦелевомуФинансированию;
//   КонецЕсли;
//
Процедура ЗаполнитьСчетПоУсловномуКоду(УсловныйКодСчета, Результат) Экспорт
	
КонецПроцедуры

// Добавляет в таблицу предопределенный счет и его условный код.
//
// Параметры:
//   СчетаСУсловнымиКодами - ТаблицаЗначений
//     * Счет - ПланСчетовСсылка.Хозрасчетный
//     * УсловныйКод - Строка
//
// Пример:
//   НовыйСчет = СчетаСУсловнымиКодами.Добавить();
//   НовыйСчет.УсловныйКод = "83.11";
//   НовыйСчет.Счет = ПланыСчетов.Хозрасчетный.НедвижимоеИОсобоЦенноеДвижимоеИмущество;
//
Процедура ДобавитьПредопределенныеСчета(СчетаСУсловнымиКодами) Экспорт
	
КонецПроцедуры

#Область ДополненияАлгоритмов

Процедура ДополнитьАлгоритмыБО2019Кв1Баланс(Алгоритмы, ПараметрыЗаполнения) Экспорт
	
КонецПроцедуры

Процедура ДополнитьБО2019Кв1Баланс(КонтекстДополнения, ИмяОбластиПоказателя, ЗначениеПоказателя) Экспорт
	
КонецПроцедуры

Процедура ДополнитьУБО2015Кв1Баланс(КонтекстДополнения, ИмяОбластиПоказателя, ЗначениеПоказателя) Экспорт
	
КонецПроцедуры

Процедура ДополнитьСпособыОбработкиСчетов(СпособыОбработки, СпособыОбработкиСчетов) Экспорт
	
КонецПроцедуры

Процедура ДополнитьБО2011Кв4Пояснения5_Строки5510и5530(КонтекстСтроки) Экспорт
	
КонецПроцедуры

Процедура ДополнитьБО2011Кв4Пояснения5_Строки5513и5533(КонтекстСтроки) Экспорт
	
КонецПроцедуры

Процедура ДополнитьБО2011Кв4Пояснения5_Строки5560и5580(КонтекстСтроки) Экспорт
	
КонецПроцедуры

Процедура ДополнитьБО2011Кв4Пояснения5_Строки5566и5586(КонтекстСтроки) Экспорт
	
КонецПроцедуры

Процедура УстановитьТекстЗапросаПоПереопределяемымТаблицамПояснения51Краткосрочная(ТекстЗапроса) Экспорт
	
КонецПроцедуры

Процедура ДополнитьПараметрыЗапросаПояснения51Краткосрочная(Запрос) Экспорт
	
КонецПроцедуры

Процедура УстановитьТекстЗапросаПоПереопределяемымТаблицамПояснения53Краткосрочная(ТекстЗапроса) Экспорт
	
КонецПроцедуры

Процедура ДополнитьПараметрыЗапросаПояснения53Краткосрочная(Запрос) Экспорт
	
КонецПроцедуры

Процедура УстановитьНаименованиеСоставляющейДополнительногоСчета(НаименованиеСоставляющейДополнительногоСчета,
	ПараметрыСоставляющих, ИмяТаблицыСоставляющих, СчетСоставляющей) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовВременныхТаблиц

Функция ТекстЗапросаВТ_ДокументыМодернизацииОС() Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	МодернизацияОС.Ссылка КАК МодернизацияОССсылка
		|ПОМЕСТИТЬ ВТ_ДокументыМодернизацииОСПереопределяемый
		|ИЗ
		|	Документ.МодернизацияОС КАК МодернизацияОС
		|ГДЕ
		|	МодернизацияОС.Организация = &Организация
		|	И МодернизацияОС.СобытиеОС.ВидСобытияОС В(&ВидыСобытийОС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацияБух.Ссылка
		|ИЗ
		|	Документ.ОперацияБух КАК ОперацияБух
		|ГДЕ
		|	ОперацияБух.Организация = &Организация
		|	И ОперацияБух.СторнируемыйДокумент ССЫЛКА Документ.МодернизацияОС
		|	И ОперацияБух.СторнируемыйДокумент.СобытиеОС.ВидСобытияОС В(&ВидыСобытийОС)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МодернизацияОССсылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область УчетнаяПолитика

Процедура ОпределитьУчетнуюПолитикуПрименяетсяФСБУ25(ПрименяетсяФСБУ25, Организация, КонецПериода) Экспорт
	
	ПрименяетсяФСБУ25 = УчетнаяПолитика.ПрименяетсяФСБУ25(Организация, КонецПериода);
	
КонецПроцедуры

Процедура ОпределитьУчетнуюПолитикуПрименяетсяУСН(ПрименяетсяУСН, Организация, КонецПериода) Экспорт
	
	ПрименяетсяУСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, КонецПериода);
	
КонецПроцедуры

Процедура ОпределитьУчетнуюПолитикуПрименяетсяАУСН(ПрименяетсяАУСН, Организация, КонецПериода) Экспорт
	
	ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(Организация, КонецПериода);
	
КонецПроцедуры

Процедура ОпределитьУчетнуюПолитикуПрименяетсяНПД(ПрименяетсяНПД, Организация, КонецПериода) Экспорт
	
	ПрименяетсяНПД = УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(Организация, КонецПериода);
	
КонецПроцедуры

Процедура ОпределитьУчетнуюПолитикуПлательщикЕНВД(ПлательщикЕНВД, Организация, КонецПериода) Экспорт
	
	ПлательщикЕНВД = УчетнаяПолитика.ПлательщикЕНВД(Организация, КонецПериода)
	
КонецПроцедуры

Процедура ОпределитьУчетнуюПолитикуСпособОценкиТоваровВРознице(СпособОценкиТоваровВРознице, Организация, КонецПериода) Экспорт
	
	СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, КонецПериода)
	
КонецПроцедуры

#КонецОбласти

Процедура ОпределитьЗасчитанныеНалогиЕНС(ЗасчитанныеНалоги, Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	// НДФЛ.
	ЗасчитанныеНалоги.НДФЛ = 0;
	
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛАгент13()));
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛАгент15()));
	ЗасчитанныеНалоги.НДФЛ = ЗасчитанныеНалоги.НДФЛ
		+ ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
			Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ_ИП,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛПредпринимателя13()));
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ_ИП,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛПредпринимателя15(ДатаОкончания)));
	ЗасчитанныеНалоги.НДФЛ = ЗасчитанныеНалоги.НДФЛ
		+ ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
			Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
	// Налог на прибыль.
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет);
	
	ЗасчитанныеНалоги.НалогНаПрибыль = ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
		Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
	// Страховые взносы.
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ЛетныеЭкипажи);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_Шахтеры);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_Добровольные);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_Добровольные);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносыЕдиныйТариф);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ОПС_ИностранныеРаботники);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ОМС_ИностранныеРаботники);
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ОСС_ИностранныеРаботники);
	
	ЗасчитанныеНалоги.СтраховыеВзносы = ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
		Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
	// Налог на прибыль с дивидендов.
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрибыль_НалоговыйАгент);
	
	ЗасчитанныеНалоги.НалогНаПрибыльСДивидендов = ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
		Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
	// НДФЛ с дивидендов.
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛАгентДивиденды13()));
	ВидыНалогов.Добавить(Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ,
		, , Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛАгентДивиденды15()));
	ЗасчитанныеНалоги.НДФЛСДивидендов = ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговЗаПериод(
		Организация, ДатаНачала, ДатаОкончания, ВидыНалогов).Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти
